zhangqiaoli/xlightRemote-stm8l/Project/src/button.c
  // Restore Device Index
  gConfig.indDevice = lv_curInd;
}

void FavoriteDevStatus(uint8_t index)
{
/*  if(index > NUM_FAVORITE) return;
  if(gConfig.favoritesDevStat[index].reserved == 0)
  { // favorite
    gLastFavoriteIndex = index;
    Msg_RequestDeviceStatus();  
  }
  else
  { // restore favorite status
    if( gConfig.favoritesDevStat[index].ring.CCT >= CT_MIN_VALUE ) {
      Msg_DevBR_CCT(gConfig.favoritesDevStat[index].ring.BR, gConfig.favoritesDevStat[index].ring.CCT);
    } else {
      Msg_DevBR_RGBW(gConfig.favoritesDevStat[index].ring.BR, gConfig.favoritesDevStat[index].ring.R, gConfig.favoritesDevStat[index].ring.G, gConfig.favoritesDevStat[index].ring.B, gConfig.favoritesDevStat[index].ring.CCT);
    }   
  }*/ 
#ifdef NUM_FAVORITE
  if(index > NUM_FAVORITE) return;
  SaveFavoriteDevStatus();
  gLastFavoriteIndex = index;
  gLastFavoriteTick = 0;
  Msg_RequestDeviceStatus(); 
#endif
}

void RestoreFavoriteDevStatus(uint8_t index)
{
#ifdef NUM_FAVORITE
  if(index >= NUM_FAVORITE) return;
 // restore favorite status
  if( gConfig.favoritesDevStat[index].ring.CCT >= CT_MIN_VALUE ) {
    Msg_DevBR_CCT(gConfig.favoritesDevStat[index].ring.BR, gConfig.favoritesDevStat[index].ring.CCT);
  } else {
    Msg_DevBR_RGBW(gConfig.favoritesDevStat[index].ring.BR, gConfig.favoritesDevStat[index].ring.R, gConfig.favoritesDevStat[index].ring.G, gConfig.favoritesDevStat[index].ring.B, gConfig.favoritesDevStat[index].ring.CCT);
  }  
#endif
}

void btn_short_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    if( gConfig.inPresentation ) {
      // Turn screen black or restore
      Msg_PPT_ObjAction(PPT_OBJ_SCREEN, DEVICE_SW_TOGGLE);
    } else {
      // Reduce CCT and get warmmer white
      Msg_DevCCT(OPERATOR_SUB, BTN_STEP_SHORT_CCT);
    }
    break;
    
  case keylstRight:
    if( gConfig.inPresentation ) {
      // Start play or stop play
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, DEVICE_SW_TOGGLE);
    } else {
      // Increase CCT and get colder white
      Msg_DevCCT(OPERATOR_ADD, BTN_STEP_SHORT_CCT);
    }
    break;
    
  case keylstUp:
    if( gConfig.inPresentation ) {
      // Page Up
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_PREV);
    } else {
      // more bright
      Msg_DevBrightness(OPERATOR_ADD, BTN_STEP_SHORT_BR);
      break;
    }
    
  case keylstDown:
    if( gConfig.inPresentation ) {
      // Page Down
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_NEXT);
    } else {
      // less bright
      Msg_DevBrightness(OPERATOR_SUB, BTN_STEP_SHORT_BR);
    }
    break;
    
  case keylstCenter:
    if( gConfig.inPresentation ) {
      // Next Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_NEXT);
    } else {
      // Toggle lights on/off
      //Msg_DevOnOff(CurrentDeviceOnOff == 0);
      Msg_DevOnOff(DEVICE_SW_TOGGLE);
    }
    break;
    
  case keylstFn1:
#ifdef BATCH_TEST
    Msg_DevBrightness(OPERATOR_SET,50);
#else
#ifdef HOME_VERSION
    FN_Button_Action(0);
#else
#ifdef ENABLE_SDTM
    // Pure Red
    Msg_DevBR_RGBW(60, 255, 0, 0, 0);
#else
    FN_Button_Action(0);
    Msg_SpecialDevOnOff(129,8,1);
#endif
#endif
#endif

    break;
    
  case keylstFn2:
#ifdef BATCH_TEST
    Msg_DevCCT(OPERATOR_SET,4600);
#else
#ifdef HOME_VERSION
    FN_Button_Action(1);   
    Msg_DevOnOffDelay(DEVICE_SW_OFF,MINUTE_UNIT,SLEEP_TIME);
#else
#ifdef ENABLE_SDTM
    // Pure Green
    Msg_DevBR_RGBW(60, 0, 255, 0, 0);
#else
    FN_Button_Action(1);
#ifdef CLASS_ROOM_TYPE    
    FN_Button_Action(2);
    Msg_SpecialDevOnOff(129,8,1);
#endif
#endif
#endif
#endif
    break;
    
  case keylstFn3:
#ifdef HOME_VERSION
    FN_Button_Action(2);
#else
#ifdef ENABLE_SDTM
    // Pure Blue
    Msg_DevBR_RGBW(60, 0, 0, 255, 0);
#else
    FN_Button_Action(2);
#ifdef CLASS_ROOM_TYPE    
    FN_Button_Action(4);
    Msg_SpecialDevOnOff(129,8,1);
#endif       
#endif
#endif    
    break;
    
  case keylstFn4:
#ifdef HOME_VERSION
    FN_Button_Action(3);
#else
#ifdef ENABLE_SDTM
    // Pure White
    Msg_DevBR_RGBW(60, 0, 0, 0, 255);
#else
#ifdef CLASS_ROOM_TYPE    
    FN_Button_Action(2);
#endif
    FN_Button_Action(3);
    Msg_SpecialDevOnOff(129,8,0);
    //Msg_DevOnOff(DEVICE_SW_TOGGLE);
#endif  
#endif  
    break;

  case keylstFLASH:
#ifdef BATCH_TEST
    Msg_DevOnOff(DEVICE_SW_ON);
#else
#ifdef HOME_VERSION
    //Favorites1
    RestoreFavoriteDevStatus(0);
#else
#ifdef ENABLE_FLASHLIGHT_LASER    
    // Toggle the flash light
    ledToggleFlashLight;
#else
    //Msg_RelayOnOff(DEVICE_SW_TOGGLE);
    FN_Button_Action(5);
#endif 
#endif
#endif
    break;
    
  case keylstLASER:
#ifdef BATCH_TEST
    Msg_DevOnOff(DEVICE_SW_OFF);
#else
#ifdef HOME_VERSION
    //Favorites2
    RestoreFavoriteDevStatus(1);
#else
#ifdef ENABLE_FLASHLIGHT_LASER    
    // Toggle laser pen
    ledToggleLaserPen;
#else
    //Msg_RelayOnOff(DEVICE_SW_TOGGLE);
    FN_Button_Action(6);
#endif
#endif   
#endif
    break;
    
  default:
    break;
  }
}

void btn_double_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    if( gConfig.inPresentation ) {
      // Replay media
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, CONTENT_REPLAY);
    } else {
      Msg_DevCCT(OPERATOR_SET, CT_MIN_VALUE);
    }
    break;
    
  case keylstRight:
    if( gConfig.inPresentation ) {
      // Play media or stop play
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, DEVICE_SW_TOGGLE);
    } else {
      Msg_DevCCT(OPERATOR_SET, CT_MAX_VALUE);
    }
    break;
    
  case keylstUp:
    if( gConfig.inPresentation ) {
      // Last Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_LAST);
    } else {
      Msg_DevBrightness(OPERATOR_SET, 100);
    }
    break;
    
  case keylstDown:
    if( gConfig.inPresentation ) {
      // First Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_FIRST);
    } else {
      Msg_DevBrightness(OPERATOR_SET, BTN_BR_LOW);
    }
    break;
    
  case keylstCenter:
    // Toggle In-presentation flag
    SwitchPPTMode(!gConfig.inPresentation);
    break;
    
  case keylstFn1:
    break;
    
  case keylstFn2:
    break;
    
